README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="README"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-28T10:25-0700"/>
<meta name="author" content="Jaime Fournier"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">README</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 pinky - Monitoring system built on Openresty</a>
<ul>
<li><a href="#sec-1-1">1.1 Purpose:</a></li>
<li><a href="#sec-1-2">1.2 How to build plugins:</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 Pinky rest structure</a></li>
<li><a href="#sec-1-2-2">1.2.2 Nginx configuration</a></li>
<li><a href="#sec-1-2-3">1.2.3 Pinky functions</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> pinky - Monitoring system built on Openresty</h2>
<div class="outline-text-2" id="text-1">




</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Purpose:</h3>
<div class="outline-text-3" id="text-1-1">


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> How to build plugins:</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Pinky rest structure</h4>
<div class="outline-text-4" id="text-1-2-1">

<ul>
<li id="sec-1-2-1-1">/pinky/ -<br/>
     All modules are loaded from here.
     There is no requirement for nginx.conf additions as a catchall
     for pinky.dispatch() is handled via /pinky/*

<ul>
<li id="sec-1-2-1-1-1">Every custom module require a preamble containing the following.<br/>



<pre class="example">local p = require 'pinky'
local json = require 'cjson'

</pre>

<p>
      This covers pulling in pinky core as well as json for output
      formatting.
</p>
<p>
      Additionally you are required to create an entry function
      called main that takes the truncated uri as it's sole argument.
</p>




<pre class="example">local empty;
local foo;
local bar;
</pre>

<p>
      Here we provide declarations of each function as local.
</p>



<pre class="example">local function pinky_main(uri)
   -- This function is the entry point.
   -- We are passed the rest of the uri.
   local args = p.split(uri,"/")

   if #args == 0 then
      return json.encode("Hello controller called with no args! (e.g. http://localhost/pinky/hello)"
   elseif #args == 1 then
      return json.encode("Hello controller called with one arg, foo! (e.g. http://localhost/pinky/hello/foo)"
   elseif #args == 2 then
      return json.encode("Hello controller called with two arg, foo! (e.g. http://localhost/pinky/hello/foo)"
   end
end

</pre>


<p>
      We strip out all previous portions of the url including the
      controller name (e.g. "/hello/")
</p>
<p>
      Each plugin is can enforces its own rest argument format.
      In this example we have three levels.
</p>
<p>
      Based on each we call a different function with the arguments
      provided.
</p>



<pre class="example">function empty()
   return "Hello controller called with no args! (e.g. http://localhost/pinky/hello)"
end

function foo()
   return "Hello controller called with one arg, foo! (e.g. http://localhost/pinky/hello/foo)"
end

function bar()
   return "Hello controller called with two args, foo and bar! (e.g. http://localhost/pinky/hello/foo/bar)"
end

</pre>


<p>
      Finally we export which functions are publicly available.
</p>



<pre class="example">return { pinky_main = pinky_main }
</pre>


<p>
      For almost all cases only pinky_main should be exported.
      Unless there is a need to make the functions available inside
      other plugins.
</p>
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Nginx configuration</h4>
<div class="outline-text-4" id="text-1-2-2">

<p>    You will need to include the following in your nginx.conf
</p>


<pre class="example">server {
    listen 44444;
    location ~ /pinky/* {
        content_by_lua '
        local pinky = require("pinky")
        ngx.say(pinky.dispatch(ngx.var.uri))
        ';
    }
}
</pre>


</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Pinky functions</h4>
<div class="outline-text-4" id="text-1-2-3">


<ul>
<li id="sec-1-2-3-1">Library<br/>
<ul>
<li id="sec-1-2-3-1-1">exec_command(command,fields,key_field,sep,tokenize)<br/>
      This function handles executing external commands.

<p>
      The arguments are:
</p><ul>
<li>command: A String containing the full path to the binary and its arguments.
</li>
<li>Fields: A table of the numeric positions to return.
</li>
<li>Key_field: The position to use as the hash key.
</li>
<li>Sep: Regular expression to split each line of output from
        command.
</li>
<li>Tokenize: Boolean to return output as a table, or a string.
<ul>
<li>true = return table
</li>
<li>nil  = return string
</li>
</ul>

</li>
</ul>


</li>
</ul>
<ul>
<li id="sec-1-2-3-1-2">dispatch(uri)<br/>
      Handler for all /pinky/ functions.

<p>
      Any calls to /pinky/foo will result in
      foo.lua being loaded if it exists.
      Then foo.pinky_main() will be called with the uri relative to /pinky/
</p>
</li>
</ul>
<ul>
<li id="sec-1-2-3-1-3">file_exists(filename)<br/>
      Function to verify a fully qualified path/file exists.
      Returns boolean.

</li>
</ul>
<ul>
<li id="sec-1-2-3-1-4">lsdir (path)<br/>
      Function to return the files in the directory passed as an argument.
</li>
</ul>
<ul>
<li id="sec-1-2-3-1-5">print_table(in_table)<br/>
      Iterate over a table and
</li>
</ul>
<ul>
<li id="sec-1-2-3-1-6">return_fields(in_table,fields)<br/>
</li>
</ul>
<ul>
<li id="sec-1-2-3-1-7">show_functions(module)<br/>

</li>
</ul>
<ul>
<li id="sec-1-2-3-1-8">split(pString, pPattern)<br/>
      Split a string into a table with pattern.

</li>
</ul>
<ul>
<li id="sec-1-2-3-1-9">dispatch(uri)<br/>
      Handler for all /pinky/ functions.

<p>
      Any calls to /pinky/foo will result in
      foo.lua being loaded if it exists.
      Then foo.pinky_main() will be called with the uri relative to /pinky/
</p>
</li>
</ul>
<ul>
<li id="sec-1-2-3-1-10">exec_command(command,fields,key_field,sep,tokenize)<br/>
      This function handles executing external commands.

<p>
      The arguments are:
</p><ul>
<li>command: A String containing the full path to the binary and its arguments.
</li>
<li>Fields: A table of the numeric positions to return.
</li>
<li>Key_field: The position to use as the hash key.
</li>
<li>Sep: Regular expression to split each line of output from
        command.
</li>
<li>Tokenize: Boolean to return output as a table, or a string.
<ul>
<li>true = return table
</li>
<li>nil  = return string
</li>
</ul>

</li>
</ul>



</li>
</ul>
<ul>
<li id="sec-1-2-3-1-11">file_exists(filename)<br/>
      Function to verify a fully qualified path/file exists.
      Returns boolean.

</li>
</ul>
<ul>
<li id="sec-1-2-3-1-12">find_first_file(array_of_files)<br/>
      This function takes a list of files and returns the first one
      that exists. Given platform differences we may have several
      places we look for something like rvm. With this we return the
      first one found.

</li>
</ul>
<ul>
<li id="sec-1-2-3-1-13">get_home<br/>
      return the home directory of the current user pinky is running
      as.

</li>
</ul>
<ul>
<li id="sec-1-2-3-1-14">get_ip(hostname)<br/>
      resolve the hostname provided to us.
      We use this to avoid using user input directly in commands.

</li>
</ul>
<ul>
<li id="sec-1-2-3-1-15">get_os<br/>
      Return operating system name as seen by uname.

</li>
</ul>
<ul>
<li id="sec-1-2-3-1-16">get_username<br/>
      Return full username of the current pinky process.

</li>
</ul>
<ul>
<li id="sec-1-2-3-1-17">lsdir(directory)<br/>
      Return a table of all of the files/directories listed within.

</li>
</ul>
<ul>
<li id="sec-1-2-3-1-18">return_fields<br/>
      Used in exec_command to return only those columns requested.

</li>
</ul>
<ul>
<li id="sec-1-2-3-1-19">split(string,delimiter)<br/>
      Lua lacks a natural string#split command so this provides it.

</li>
</ul>
<ul>
<li id="sec-1-2-3-1-20">treewalker(path,function)<br/>
      This function will walk a directory tree returning all files it
      finds. This is used in items like /proc where we want the full
      ps tree.

</li>
</ul>
<ul>
<li id="sec-1-2-3-1-21">trim(string)<br/>
      Remove trailing white space.

</li>
</ul>
<ul>
<li id="sec-1-2-3-1-22">print_table(table)<br/>
      Debug method used when resolving problems.
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-05-28T10:25-0700</p>
<p class="author">Author: Jaime Fournier</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
